INSERT INTO WATERING_METHOD (method_key, title, description)
values (
'DIRECT_IRRIGATION',
'آبیاری مستقیم'
,
'آبیاری مستقیم یک روش ساده و موثر برای آبیاری گیاهان است که شامل استفاده از آب‌پاش، لیوان یا دیگ آبیاری می‌شود. در این روش، آب به صورت مستقیم و متناوب بر روی خاک گیاه پاشیده یا ریخته می‌شود، که این کار به طور مستقیم به ریشه‌ها دسترسی دارد و برای حفظ رطوبت خاک و جلوگیری از خشک شدن سطح آن موثر است'
),
(
'SUB_IRRIGATION',
'آبیاری زیرکانونی'
,
'آبیاری زیرکانونی یک روش آبیاری موثر برای گیاهان است که در آن، آب از زیر گلدان به خاک گیاه منتقل می‌شود. در این روش، گلدان‌ها بر روی یک ظرف یا پایه قرار داده می‌شوند که در آن آب جمع می‌شود. سپس با استفاده از جاذب یا لوله‌های جانبی، آب به طور مداوم یا متناوب به خاک گیاه منتقل می‌شود. این روش علاوه بر جلوگیری از خشک شدن سطح خاک، می‌تواند از مرگ زیری‌های گیاه و ایجاد محیط رطوبتی برای ریشه‌ها جلوگیری کند، که باعث رشد سالم‌تر گیاه می‌شود.'
)
;

UPDATE PLANT
SET watering_method_id = 1
WHERE id = 1;